app/controllers/campaigns_controller.rb

  def category_1
  	@campaigns = Campaign.order(:created_at)
---
SELECT "campaigns".* FROM "campaigns"  ORDER BY "campaigns"."created_at" ASC

  def category_2
  	@campaigns = Campaign.order(:created_at)
---
SELECT "campaigns".* FROM "campaigns"  ORDER BY "campaigns"."created_at" ASC

  def category_3
  	@campaigns = Campaign.order(:created_at)
---
SELECT "campaigns".* FROM "campaigns"  ORDER BY "campaigns"."created_at" ASC

  def category_4
  	@campaigns = Campaign.order(:created_at)
---
SELECT "campaigns".* FROM "campaigns"  ORDER BY "campaigns"."created_at" ASC

  def category_5
  	@campaigns = Campaign.order(:created_at)
---
SELECT "campaigns".* FROM "campaigns"  ORDER BY "campaigns"."created_at" ASC