app/controllers/campaigns_controller.rb

  def index
  	#@campaigns = Campaign.where(:goal <= Campaign.sum_of_donations).order("created_on DESC")
  	 @campaigns = Campaign.order(:created_at)
---
SELECT "campaigns".* FROM "campaigns"  ORDER BY "campaigns"."created_at" ASC

  def show
    @campaign = Campaign.find(params[:id])
---
SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @user = current_user
    @campaign = @user.campaigns.build(campaign_params)
    @campaign.user = current_user
    if @campaign.save
---
INSERT INTO "campaigns" ("title", "description", "review", "goal", "category", "image_url", "end_date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @campaign = Campaign.find(params[:id])
---
SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @campaign = Campaign.find(params[:id])
    if @campaign.update_attributes(campaign_params)
---
SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "campaigns" SET "title" = ?, "review" = ?, "updated_at" = ? WHERE "campaigns"."id" = ?  [["title", "Escoba 5001"], ["review", "Es una escoba pero 5001"], ["updated_at", "2016-12-19 19:11:31.191211"], ["id", 2]]

  def category_1
  	@campaigns = Campaign.where(category: 'Medica')
---
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."category" = ?  [["category", "Medica"]]

  def category_2
  	@campaigns = Campaign.where(category: 'Deportes')
---
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."category" = ?  [["category", "Deportes"]]

  def category_3
  	@campaigns = Campaign.where(category: 'Animales')
---
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."category" = ?  [["category", "Animales"]]

  def category_4
  	@campaigns = Campaign.where(category: 'Negocios')
---
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."category" = ?  [["category", "Negocios"]]

  def category_5
  	@campaigns = Campaign.where(category: 'Caridad')
---
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."category" = ?  [["category", "Caridad"]]