app/controllers/comments_controller.rb

  def new
  	@campaign = Campaign.find(params[:campaign_id])
---
SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT 1  [["id", 1]]

  def create
  	@campaign = Campaign.find(params[:campaign_id])
  	@comment = @campaign.comments.build(comment_params)
  	@campaign.user = current_user
    @user = current_user
    if @comment.save
---
SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("author", "message", "campaign_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Prueba_User"], ["message", "Este es un comentario de Prueba"], ["campaign_id", 1], ["created_at", "2016-12-19 08:50:16.132052"], ["updated_at", "2016-12-19 08:50:16.132052"]]