app/controllers/donations_controller.rb

SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
  	@campaign = Campaign.find(params[:campaign_id])

SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "donations" ("author", "message", "amount", "campaign_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author", "Prueba_Autor"], ["message", "Prueba de Donacion"], ["amount", 100.0], ["campaign_id", 1], ["created_at", "2016-12-19 09:06:20.372659"], ["updated_at", "2016-12-19 09:06:20.372659"]]
---
  def create
  	@campaign = Campaign.find(params[:campaign_id])
  	@donation = @campaign.donations.build(donation_params)
  	@campaign.user = current_user
    @user = current_user
    if @donation.save