app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "country", "city", "email_notification", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.new(user_params)
  	if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Kevin Prueba"], ["password_digest", "$2a$10$uxy9kF6cRsT.pKgJfkhsZeqBCHwaHCxhmFOlPiVpTX7e8afVXrm8e"], ["updated_at", "2016-12-19 19:32:05.484811"], ["id", 1]]
---
  def update
    @user = User.find(current_user.id)

    if @user.update_attributes(user_params)