app/views/campaigns/_campaign.html.erb

	<td><%= nice_date(campaign.created_at) %></td>
	<td><%= User.find(campaign.user_id).name %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]