app/views/campaigns/show.html.erb

      <p> Nombre </p>
      <h3> <%= @campaign.user.country %> </h3>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]